teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_f0.c
/**
******************************************************************************
* @file    x_nucleo_cca02m1_audio_f0.c
* @author  Central Labs
* @version V3.0.0
* @date    21-March-2018
* @brief   This file provides the Audio driver for the X-NUCLEO-CCA02M1 
*          expansion board 
*******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/ 




/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "x_nucleo_cca02m1_audio_f0.h"

/** @addtogroup BSP
* @{
*/

/** @addtogroup X-NUCLEO-CCA02M1
* @{
*/

/** @addtogroup X-NUCLEO-CCA02M1_AUDIO_F0
  * @brief This file provides set of firmware functions to manage MEMS microphones
  *        initialization on STM32F0xx-Nucleo Kit from STMicroelectronics.
* @{
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Types
* @{
*/ 

/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Defines 
* @{
*/ 

/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Macros 
* @{
*/

/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Variables
* @{
*/
#define CHANNEL_DEMUX_MASK                    	0x55

I2S_HandleTypeDef                 hAudioInI2s;
SPI_HandleTypeDef                 hAudioInSPI;

static TIM_HandleTypeDef          TimDividerHandle;
static TIM_SlaveConfigTypeDef     sSlaveConfig;
static TIM_IC_InitTypeDef         sICConfig;
static TIM_OC_InitTypeDef         sOCConfig;

static X_NUCLEO_CCA02M1_HandlerTypeDef X_NUCLEO_CCA02M1_Handler;

static uint16_t I2S_InternalBuffer[PDM_INTERNAL_BUFFER_SIZE_I2S];
static uint16_t SPI_InternalBuffer[PDM_INTERNAL_BUFFER_SIZE_SPI];

static uint16_t AudioInVolume = 64;
static PDMFilter_InitStruct Filter[2];

#ifdef USE_ARM_DECIMATION
/*This is required to achieve a decimation greater than 128
It's used for the 8KHz fs*/
#include "arm_math.h"
static int16_t aCoeffs[] = { -1406, 1634, -1943, 2386, -3080, 4325, -7223, 21690, 21690, -7223, 4325, -3080, 2386, -1943, 1634, -1406, };
#define DECIMATOR_NUM_TAPS 16
#define DECIMATOR_BLOCK_SIZE 16 
#define DECIMATOR_FACTOR 2
#define DECIMATOR_STATE_LENGTH (DECIMATOR_BLOCK_SIZE + (DECIMATOR_NUM_TAPS) -1)
static arm_fir_decimate_instance_q15 ARM_Decimator_State[4];
static int16_t aState_ARM[4][DECIMATOR_STATE_LENGTH];
#endif

uint8_t Channel_Demux[128] = {
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
  0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f
};
/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Function_Prototypes 
* @{
*/ 

static uint8_t AUDIO_IN_Timer_Start(void);
static uint8_t AUDIO_IN_Timer_Init(void);
static void AUDIO_IN_I2S_MspInit(void);
static void AUDIO_IN_SPI_MspInit(void);
/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Exported_Functions 
* @{
*/   

/**
* @brief  Initializes audio acquisition recording.
* @param  AudioFreq: Audio frequency to be configured for the peripherals.
* 		  Possible values are 8000, 16000, 32000 or 48000 Hz
* @param  BitRes: Not used.
* @param  ChnlNbr: Number of channels to be recorded.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
__weak uint8_t BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{
  /*Set Structure for internal state*/
  X_NUCLEO_CCA02M1_Handler.MicChannels = ChnlNbr;
  
  switch (AudioFreq)
  {
  case AUDIO_IN_FS_8000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 1280; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 8000;
    
    break;
    
  case AUDIO_IN_FS_16000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = PDM_FREQ_16K; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 16000;
    break;
    
  case AUDIO_IN_FS_32000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 2048; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 32000;
    break;
    
  case AUDIO_IN_FS_48000:
    X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq = 3072; /*KHz*/
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq = 48000;
    break;
  default:
    return AUDIO_ERROR;
  }
  
  
  X_NUCLEO_CCA02M1_Handler.DecimationFactor = (X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq * 1000) /
    X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq;
  X_NUCLEO_CCA02M1_Handler.PdmBufferSize = (X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq / 8) * 2 * N_MS_PER_INTERRUPT;
  
  uint16_t PDM_I2S_Clock = X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq;
  
  if (X_NUCLEO_CCA02M1_Handler.MicChannels > 1)
  {
    PDM_I2S_Clock *= 2;  /*Clock to be generated is twice the PDM clock */
    /*Timer Init*/
    if (AUDIO_IN_Timer_Init() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  /* I2S Peripheral configuration */
  hAudioInI2s.Instance          = AUDIO_IN_I2S_INSTANCE;
  __HAL_I2S_DISABLE(&hAudioInI2s);
  
  if(X_NUCLEO_CCA02M1_Handler.MicChannels == 1)
  {
    hAudioInI2s.Init.DataFormat   = I2S_DATAFORMAT_16B;
  }
  else
  {
    hAudioInI2s.Init.DataFormat   = I2S_DATAFORMAT_32B;
  }
  
  hAudioInI2s.Init.AudioFreq = ((X_NUCLEO_CCA02M1_Handler.PDM_Clock_Freq * 1000) / 32);
  hAudioInI2s.Init.CPOL         = I2S_CPOL_LOW;
  hAudioInI2s.Init.MCLKOutput   = I2S_MCLKOUTPUT_DISABLE;
  hAudioInI2s.Init.Mode         = I2S_MODE_MASTER_RX;
  hAudioInI2s.Init.Standard     = I2S_STANDARD_MSB;
  
  if(HAL_I2S_GetState(&hAudioInI2s) == HAL_I2S_STATE_RESET)
  {
    AUDIO_IN_I2S_MspInit();
  }
  
  if(HAL_I2S_Init(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  /*End I2S Init*/
  
  /*SPI Init*/
  if(X_NUCLEO_CCA02M1_Handler.MicChannels > 2)
  {
    /* Set the SPI parameters */
    hAudioInSPI.Instance               = AUDIO_IN_SPI_INSTANCE;
    hAudioInSPI.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    hAudioInSPI.Init.Direction         = SPI_DIRECTION_2LINES_RXONLY;
    hAudioInSPI.Init.CLKPhase          = SPI_PHASE_2EDGE;
    hAudioInSPI.Init.CLKPolarity       = SPI_POLARITY_HIGH;
    hAudioInSPI.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLED;
    hAudioInSPI.Init.CRCPolynomial     = 7;
    hAudioInSPI.Init.DataSize          = SPI_DATASIZE_16BIT;
    hAudioInSPI.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    hAudioInSPI.Init.NSS               = SPI_NSS_SOFT;
    hAudioInSPI.Init.TIMode            = SPI_TIMODE_DISABLED;
    hAudioInSPI.Init.Mode              = SPI_MODE_SLAVE;
    
