teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_f0.c
    /* Initialize the I2S peripheral with the structure above */
    if(HAL_SPI_GetState(&hAudioInSPI) == HAL_SPI_STATE_RESET)
    {
      AUDIO_IN_SPI_MspInit();
    }
    if(HAL_SPI_Init(&hAudioInSPI) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
  /*End SPI init*/
  
  /*PDM Filter Init*/
  BSP_AUDIO_IN_PDMToPCM_Init(X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq, X_NUCLEO_CCA02M1_Handler.MicChannels,
                             X_NUCLEO_CCA02M1_Handler.MicChannels);
  
  /*End PDM Filter Init*/
  
  return AUDIO_OK;
}

/**
* @brief  Starts audio recording.
* @param  * pbuf: Buffer that will contain 1 ms of PDM for each microphone.
				  Its dimension must be equal to (in uint16_t words): 
				  ((PCM sampling frequency)/1000 * DecimationFactor * Channels)/16
				  DecimationFactor is equal to 128 for 8000 KHZ sampling frequency, 64 in all the other cases
* @param  size: Not used in this driver.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Record(uint16_t * pbuf, uint32_t size)
{  
  X_NUCLEO_CCA02M1_Handler.PDM_Data = pbuf;  
  if(X_NUCLEO_CCA02M1_Handler.MicChannels > 2)
  {
    if(HAL_SPI_Receive_DMA(&hAudioInSPI, (uint8_t *)SPI_InternalBuffer, X_NUCLEO_CCA02M1_Handler.PdmBufferSize) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  } 

  if(X_NUCLEO_CCA02M1_Handler.MicChannels != 1)
  {
    if(AUDIO_IN_Timer_Start() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }  

  if(HAL_I2S_Receive_DMA(&hAudioInI2s, I2S_InternalBuffer, X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2) != HAL_OK)
  {
    return AUDIO_ERROR;
  }  

  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Stops audio recording.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Stop(void)
{
  if(HAL_I2S_DMAStop(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }  
  /* Return 0 if all operations are OK */
  return AUDIO_OK;  
}

/**
* @brief  Controls the audio in volume level.
* @param  Volume: Volume level to be set for the PDM to PCM conversion. 
		  Values must be in the range from 0 to 64
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  /* Set the Global variable AudioInVolume */
  AudioInVolume = Volume;  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Converts audio format from PDM to PCM.
* @param  PDMBuf: Pointer to PDM buffer data
* @param  PCMBuf: Pointer to PCM buffer data
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
__weak uint8_t BSP_AUDIO_IN_PDMToPCM(uint16_t *PDMBuf, uint16_t *PCMBuf)
{  
 uint32_t index = 0;  
  uint32_t index1 = 0; 
  uint32_t index_ms = 0;
  uint16_t PDM_Offset = (X_NUCLEO_CCA02M1_Handler.PdmBufferSize / (2 * N_MS_PER_INTERRUPT)) * X_NUCLEO_CCA02M1_Handler.MicChannels;
  uint16_t PCM_Offset = (X_NUCLEO_CCA02M1_Handler.MicChannels * (X_NUCLEO_CCA02M1_Handler.PCM_Sampling_Freq / 1000));
  
  for (index_ms = 0; index_ms < N_MS_PER_INTERRUPT; index_ms ++)
  {
    if(X_NUCLEO_CCA02M1_Handler.DecimationFactor == 128)
    {
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.MicChannels; index++)
      {
        PDM_Filter_128_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }    
    else if(X_NUCLEO_CCA02M1_Handler.DecimationFactor == 64)
    {
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.MicChannels; index++)
      {
        PDM_Filter_64_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }     
    else if(X_NUCLEO_CCA02M1_Handler.DecimationFactor == 80)
    {
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.MicChannels; index++)
      {
        PDM_Filter_80_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);
      }
    }
    else if(X_NUCLEO_CCA02M1_Handler.DecimationFactor == 160)
    {      
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.MicChannels; index++)
      {
        int16_t PCM_Decimator_IN[16];
        PDM_Filter_80_LSB(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)(PCM_Decimator_IN), AudioInVolume , (PDMFilter_InitStruct *)&Filter[index]);       
#ifdef USE_ARM_DECIMATION
        int16_t PCM_Decimator_OUT[8];
        arm_fir_decimate_q15 (&ARM_Decimator_State[index], (q15_t *)PCM_Decimator_IN, (q15_t*)PCM_Decimator_OUT, DECIMATOR_BLOCK_SIZE);
#endif        
        for(index1 = 0; index1 < 8; index1++)
        {
#ifdef USE_ARM_DECIMATION
          PCMBuf[index1 * X_NUCLEO_CCA02M1_Handler.MicChannels + index + index_ms * PCM_Offset] = PCM_Decimator_OUT[index1];
#else
          PCMBuf[index1 * X_NUCLEO_CCA02M1_Handler.MicChannels + index + index_ms * PCM_Offset] = PCM_Decimator_IN[index1 * 2];
#endif
        }
      }      
    }
  }
  return AUDIO_OK;
}

/**
* @brief  Pauses the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Pause(void)
{    
  /* Call the Media layer pause function */
  HAL_I2S_DMAPause(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Resumes the audio file stream.
* @param  None    
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Resume(void)
{    
  /* Call the Media layer pause/resume function */
  HAL_I2S_DMAResume(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief Rx Transfer completed callbacks. It performs demuxing of the bit-interleaved PDM streams into 
	     byte-interleaved data suitable for PDM to PCM conversion. 1 ms of data for each microphone is 
		 written into the buffer that the user indicates when calling the BSP_AUDIO_IN_Start(...) function.
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
uint32_t index = 0;
  
  switch(X_NUCLEO_CCA02M1_Handler.MicChannels){
  case 1:
    {
      uint16_t * DataTempI2S = &I2S_InternalBuffer[X_NUCLEO_CCA02M1_Handler.PdmBufferSize/4] ;
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.PdmBufferSize/4; index++)
      {
        X_NUCLEO_CCA02M1_Handler.PDM_Data[index] = HTONS(DataTempI2S[index]);
      }
      break;
    }
    
