teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_f0.c
  case 2:
    {      
      uint16_t * DataTempI2S = &(I2S_InternalBuffer[X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2]);
      uint8_t a,b=0;
      for(index=0; index<X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2; index++) {
        a = ((uint8_t *)(DataTempI2S))[(index*2)];
        b = ((uint8_t *)(DataTempI2S))[(index*2)+1];
        ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*2)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] | Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*2)+1] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }    
  case 4:
    {      
      uint16_t * DataTempI2S = &(I2S_InternalBuffer[X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2]);
      uint16_t * DataTempSPI = &(SPI_InternalBuffer[X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2]);
      uint8_t a,b=0;
      for(index=0; index<X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2; index++) {
        
        a = ((uint8_t *)(DataTempI2S))[(index*2)];
        b = ((uint8_t *)(DataTempI2S))[(index*2)+1];
        ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
          Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
          ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+1] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
            
            a = ((uint8_t *)(DataTempSPI))[(index*2)];
            b = ((uint8_t *)(DataTempSPI))[(index*2)+1];
            ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+2] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
              Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
              ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+3] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |
                Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }
  default:
    {
      
      break;
    }
    
  }
  
  BSP_AUDIO_IN_TransferComplete_CallBack();
}

/**
* @brief Rx Transfer completed callbacks. It performs demuxing of the bit-interleaved PDM streams into 
	     byte-interleaved data suitable for PDM to PCM conversion. 1 ms of data for each microphone is 
		 written into the buffer that the user indicates when calling the BSP_AUDIO_IN_Start(...) function.
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
 uint32_t index = 0;
  switch(X_NUCLEO_CCA02M1_Handler.MicChannels){
  case 1:
    {
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      for(index = 0; index < X_NUCLEO_CCA02M1_Handler.PdmBufferSize/4; index++)
      {
        X_NUCLEO_CCA02M1_Handler.PDM_Data[index] = HTONS(DataTempI2S[index]);
      }
      break;
    }    
  case 2:
    {      
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      uint8_t a,b=0;
      for(index=0; index<X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2; index++) {
        a = ((uint8_t *)(DataTempI2S))[(index*2)];
        b = ((uint8_t *)(DataTempI2S))[(index*2)+1];
        ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*2)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
          Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
          ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*2)+1] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
      }      
      break;
    }    
  case 4:
    {      
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      uint16_t * DataTempSPI = SPI_InternalBuffer;
      uint8_t a,b=0;
      for(index=0; index<X_NUCLEO_CCA02M1_Handler.PdmBufferSize/2; index++) 
      {        
        a = ((uint8_t *)(DataTempI2S))[(index*2)];
        b = ((uint8_t *)(DataTempI2S))[(index*2)+1];
        ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
          Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
          ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+1] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
            
            a = ((uint8_t *)(DataTempSPI))[(index*2)];
            b = ((uint8_t *)(DataTempSPI))[(index*2)+1];
            ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+2] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
              Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
              ((uint8_t *)(X_NUCLEO_CCA02M1_Handler.PDM_Data))[(index*4)+3] = Channel_Demux[(a>>1) & CHANNEL_DEMUX_MASK] |
                Channel_Demux[(b>>1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;   
    }
  default:
    {      
      break;
    }
    
  }
  
  BSP_AUDIO_IN_HalfTransfer_CallBack();
}

/**
* @brief  User callback when record buffer is filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @brief  User callback when record buffer is half filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @brief  Audio IN Error callback function
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_Error_Callback(void)
{   
  /* This function is called when an Interrupt due to transfer error on or peripheral
  error occurs. */
}

/**
* @brief I2S error callbacks
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  /* Manage the error generated on DMA FIFO: This function 
  should be coded by user (its prototype is already declared in stm32f4_discovery_audio.h) */  
  if(hi2s->Instance == AUDIO_IN_I2S_INSTANCE)
  {
    BSP_AUDIO_IN_Error_Callback();
  }
}

/**
* @}
*/ 

/** @defgroup X-NUCLEO-CCA02M1_AUDIO_F0_Private_Functions 
* @{
*/ 

/**
* @brief  Initialize the PDM library.
* @param  AudioFreq: Audio sampling frequency
* @param  ChnlNbrIn: Number of input audio channels in the PDM buffer
* @param  ChnlNbrOut: Number of desired output audio channels in the  resulting PCM buffer
* @retval None
*/
__weak uint8_t BSP_AUDIO_IN_PDMToPCM_Init(uint32_t AudioFreq, uint32_t ChnlNbrIn, uint32_t ChnlNbrOut)
{
  uint32_t i = 0;
  /* Enable CRC peripheral to unlock the PDM library */
  __CRC_CLK_ENABLE();
  
for(i = 0; i < ChnlNbrIn; i++)
  {  
    if(AudioFreq == 8000)
    {    
      Filter[i].LP_HZ = AudioFreq;
      Filter[i].HP_HZ = 10;
      Filter[i].Fs = AudioFreq * 2;
      Filter[i].Out_MicChannels = 1;
      Filter[i].In_MicChannels = ChnlNbrIn;
#ifdef USE_ARM_DECIMATION
      /*Additional: to be removed / changed when new PDMtoPCM*/
      arm_fir_decimate_init_q15  (&ARM_Decimator_State[i], DECIMATOR_NUM_TAPS, DECIMATOR_FACTOR, aCoeffs, aState_ARM[i],
                                  DECIMATOR_BLOCK_SIZE);
#endif
    }
    else
    {
      /* Filter LP and HP Init */
      Filter[i].LP_HZ = AudioFreq / 2;
      Filter[i].HP_HZ = 10;
      Filter[i].Fs = AudioFreq;
      Filter[i].Out_MicChannels = ChnlNbrOut;
      Filter[i].In_MicChannels = ChnlNbrIn;
      
